{"company":[{"id":"125","name":"ApiAxle","summary":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data","details":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data and you can more easily manage costs. ApiAxle is open-source. This means you can modify it as much as you like and contribute changes back. Others will do the same and gradually the system will become all the better for it.","website":"http:\/\/apiaxle.com\/","twitter":"https:\/\/twitter.com\/apiaxle","github":"https:\/\/github.com\/apiaxle","blog":"http:\/\/blog.apiaxle.com\/","blogrss":"http:\/\/blog.apiaxle.com\/feed.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-axle-logo-3.png","logo_width":"225","screenshot":null,"tags":"API Management,API-Deployment"},{"id":"3","name":"Apigee","summary":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises li","details":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises like Comcast, GameSpy, TransUnion Interactive, Guardian Life and Constant Contact and thousands of developers use Apigee's technology.\nApigee provides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community. Apigee also provides articles, white papers, and other resources to help you deliver your API.","website":"https:\/\/apigee.com","twitter":"https:\/\/twitter.com\/Apigee","github":"https:\/\/github.com\/apigee","blog":"https:\/\/blog.apigee.com\/front","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apigee-logo.gif","logo_width":"175","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3341_apigee_oauth.png","tags":"API Discovery,API Gateway,API Management,API-Deployment,Apigee,Authentication,BaaS,Security,Utility"},{"id":"90","name":"APISpark","summary":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web AP","details":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web APIs, which includes APISpark, the PaaS version of Restlet. APISpark lets you build and deploy your web APIs, which includes the creation, hosting and management--all in one solution.","website":"https:\/\/apispark.com\/","twitter":"https:\/\/twitter.com\/apispark","github":"https:\/\/github.com\/apispark","blog":"http:\/\/blog.restlet.com\/","blogrss":"http:\/\/blog.restlet.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/apispark-logo","logo_width":"225","screenshot":null,"tags":"API Management,API-Deployment,API-Deployment,Spreadsheets"},{"id":"59","name":"Appcelerator","summary":"Appcelerator is the leading enterprise-grade, cross-platform development solution on the market today, with over 1.6 million developers using its software to power over 30,000 cloud-connected mobile, desktop, and web applications used on 30 million devices every day. The company's flagship offering, Appcelerator Titanium, is the only mobile cloud platform to enable fully native, cross-platform mob","details":"Appcelerator is the leading enterprise-grade, cross-platform development solution on the market today, with over 1.6 million developers using its software to power over 30,000 cloud-connected mobile, desktop, and web applications used on 30 million devices every day. The company's flagship offering, Appcelerator Titanium, is the only mobile cloud platform to enable fully native, cross-platform mobile app and HTML5 web development, from a single code base. Appcelerator's customers can leverage their existing skills and open, industry standard technologies to decrease time-to-market and development costs, increase customer adoption and revenues, and enjoy greater flexibility and control.","website":"http:\/\/www.appcelerator.com\/","twitter":"https:\/\/twitter.com\/appcelerator","github":"https:\/\/github.com\/appcelerator","blog":"http:\/\/www.appcelerator.com\/blog\/","blogrss":"http:\/\/www.appcelerator.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/appcelerator-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6766_appcelerator.png","tags":"API-Deployment,BaaS"},{"id":"1910","name":"elasticsearch","summary":"Elasticsearch is on a mission to organize data and make it easily accessible. The company delivers the world&rsquo;s the most advanced open source search and analytics engine available and make real-time data exploration available to anyone. By having a laser focus on achieving the best user experience imaginable, Elasticsearch has become one of the most popular and rapidly growing open source sol","details":"Elasticsearch is on a mission to organize data and make it easily accessible. The company delivers the world&rsquo;s the most advanced open source search and analytics engine available and make real-time data exploration available to anyone. By having a laser focus on achieving the best user experience imaginable, Elasticsearch has become one of the most popular and rapidly growing open source solutions in the market. Today, Elasticsearch is used by thousands of enterprises in virtually every industry. We take good care of our customers and users, providing production support, development support and training worldwide.","website":"http:\/\/www.elasticsearch.org\/","twitter":"https:\/\/twitter.com\/elasticsearch","github":"https:\/\/github.com\/elasticsearch\/","blog":"http:\/\/www.elasticsearch.org\/blog\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/1910_logo.jpg","logo_width":"150","screenshot":null,"tags":"API-Deployment,API-NL,Index,Search"},{"id":"593","name":"Fluidinfo","summary":"Fluidinfo are the makers of FluidDB, an online &ldquo;cloud&rdquo; database. Using a flexible underlying representation of information and a new model of control, FluidDB allows users and applications to work with information more naturally. That includes dynamically organizing, sharing, combining and augmenting information, and searching in ways that have previously not been possible. It also all","details":"Fluidinfo are the makers of FluidDB, an online &ldquo;cloud&rdquo; database. Using a flexible underlying representation of information and a new model of control, FluidDB allows users and applications to work with information more naturally. That includes dynamically organizing, sharing, combining and augmenting information, and searching in ways that have previously not been possible. It also allows users to choose exactly which information to share with whom, with separate controls for reading and writing. FluidDB lets data be social. It allows almost unlimited information personalization by individual users and applications, and also between them. This makes it simple to build a wide variety of applications that benefit from cooperation, and which are open to unanticipated future enhancements. More importantly, FluidDB facilitates and encourages the growth of applications that leave users in control of their own data.","website":"http:\/\/doc.fluidinfo.com\/fluidDB\/api\/index.html","twitter":"https:\/\/twitter.com\/fluidinfo","github":"","blog":"http:\/\/blogs.fluidinfo.com\/fluidDB","blogrss":"http:\/\/blogs.fluidinfo.com\/fluidinfo\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/fluid-info-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/2517_fluiddb.png","tags":"API-Deployment,Freshbooks,Stack"},{"id":"137","name":"Google","summary":"Google Inc. is an American multinational corporation specializing in Internet-related services and products. These include search, cloud computing, software and online advertising technologies. Google provides search and advertising services, which together aim to organize and monetize the world&rsquo;s information. In addition to its dominant search engine, it offers a plethora of online tools an","details":"Google Inc. is an American multinational corporation specializing in Internet-related services and products. These include search, cloud computing, software and online advertising technologies. Google provides search and advertising services, which together aim to organize and monetize the world&rsquo;s information. In addition to its dominant search engine, it offers a plethora of online tools and platforms.","website":"https:\/\/developers.google.com\/","twitter":"","github":"https:\/\/github.com\/google","blog":"","blogrss":"http:\/\/googlecode.blogspot.com\/feeds\/posts\/default?alt=rss","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/google-logo.jpg","logo_width":"170","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/2137_youtube.png","tags":"Advertising,API-Deployment,Database,Geo-Stack,Geo-Stack-Location,Geo-Stack-Mapping,Mapping,Orange-Report-Transportation,PaaS,Payment-API,Payments,Real-Time,Search,Social,Spreadsheets,Stack,Transit"},{"id":"1728","name":"import.io","summary":"Importio turns the web into a database, releasing the vast potential of data trapped in websites. Allowing you to identify a website, select the data and treat it as a table in your database. In effect transform the data into a row and column format. You can then add more websites to your data set, the same as adding more rows and query in real-time to access the data.","details":"Importio turns the web into a database, releasing the vast potential of data trapped in websites. Allowing you to identify a website, select the data and treat it as a table in your database. In effect transform the data into a row and column format. You can then add more websites to your data set, the same as adding more rows and query in real-time to access the data.","website":"http:\/\/docs.import.io\/","twitter":"https:\/\/twitter.com\/importio","github":"https:\/\/github.com\/import-io","blog":"http:\/\/blog.import.io\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/1728_logo.png","logo_width":"150","screenshot":null,"tags":"Analytics,API-Deployment,API-Scraping-Deployment,API-United-Kingdom,Data,Scraping"},{"id":"22","name":"Intel","summary":"Intel Expressway API Manager, powered by Mashery, helps enterprises to integrate 3rd-party APIs with their own on-prem or cloud based internal data services. This provides enterprise class security, legacy integration, and a more flexible enterprise ready MBaaS platform for the development of mobile applications. In conjunction, the Intel&reg; HTML5 Development Environment addresses development cy","details":"Intel Expressway API Manager, powered by Mashery, helps enterprises to integrate 3rd-party APIs with their own on-prem or cloud based internal data services. This provides enterprise class security, legacy integration, and a more flexible enterprise ready MBaaS platform for the development of mobile applications. In conjunction, the Intel&reg; HTML5 Development Environment addresses development cycle challenges with the Intel&reg; XDK - Cross platform development kit enabling &ldquo;write it once, deploy to many&rdquo; mobile platforms.. Intel's App Dev center is a cloud-based service that packages HTML5 apps for Apple iOS, Google Android, Amazon Kindle, Facebook, and other App Stores. Intel also provides APIs through its Cloud Services Platform, including location-based, identity, commerce, context, and recommendation services.","website":"https:\/\/intel.com","twitter":"https:\/\/twitter.com\/Intel","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/intel-logo.jpg","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Intel-Screenshot.png","tags":"API Gateway,API-Deployment,BaaS,Enterprise,Intel"},{"id":"8","name":"CA Layer7","summary":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in","details":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in 2003, Layer 7 operates in the US, Canada and Europe. Our customers include leading insurance, banking, telecom and government organizations. The company is venture backed by leading Canadian and US investors.","website":"http:\/\/www.layer7tech.com\/","twitter":"https:\/\/twitter.com\/layer7","github":"https:\/\/github.com\/Layer7tech","blog":"http:\/\/www.layer7tech.com\/blogs\/","blogrss":"http:\/\/www.layer7tech.com\/blogs\/index.php\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/layer7-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6334_apify.png","tags":"API Gateway,API Management,API-Deployment,Layer7"},{"id":"1813","name":"Oracle SOA","summary":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and re","details":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and reduces deployment risks. Offers rich integration with many identity and access management platforms. Helps streamline regulatory compliance through authentication, authorization, and audit capabilities.","website":"http:\/\/www.oracle.com\/us\/products\/middleware\/identity-management\/api-gateway\/overview\/index.html","twitter":"https:\/\/twitter.com\/OracleSOA","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/oracle-logo.jpg","logo_width":"150","screenshot":null,"tags":"API Gateway,API Management,API-Deployment"},{"id":"1361","name":"SlashDB","summary":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB autom","details":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB automatically turns databases into online resource so their  content becomes accessible to authorized web, mobile and enterprise  applications for reading and writing under standard data formats.  Technically speaking, it makes REST APIs out of relational databases.","website":"http:\/\/www.slashdb.com\/","twitter":"http:\/\/twitter.com\/slash_db","github":"","blog":"","blogrss":"http:\/\/www.slashdb.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/slashdb-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/7335_slashdb.png","tags":"API Management,API-Deployment"},{"id":"20","name":"SOA Software","summary":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio","details":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio Manager, a planning governance product that helps ensure the alignment of SOA programs with strategic IT investment and business objectives. The company also provides Service Manager, a SOA management and security product, which provides security, routing, mediation, monitoring, and management for SOA and Web services; and SOLA, which provides a governable mainframe SOA platform.","website":"http:\/\/soa.com","twitter":"https:\/\/twitter.com\/SOASoftwareInc","github":"","blog":"http:\/\/blog.soa.com\/","blogrss":"http:\/\/feeds.feedburner.com\/SOA\/Blog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/soa-software-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Atmosphere-Screenshot.png","tags":"API Gateway,API Management,API-Deployment,Enterprise,SOA Software"},{"id":"1688","name":"SwiftIQ","summary":"SwiftIQ provides web-service application programming interface (API) infrastructure to facilitate data accessibility and predictive analytics through the Swift Access and Swift Predictions products. Swift Access is an award-winning backend platform to unify and secure disconnected data then deliver and analyze it on-demand to power real-time digital actions. Swift Predictions allows users to apply","details":"SwiftIQ provides web-service application programming interface (API) infrastructure to facilitate data accessibility and predictive analytics through the Swift Access and Swift Predictions products. Swift Access is an award-winning backend platform to unify and secure disconnected data then deliver and analyze it on-demand to power real-time digital actions. Swift Predictions allows users to apply adaptive, machine learning algorithms to discover insights fast and make applications smarter. The Company was founded in 2011 and headquartered in Chicago, IL.","website":"http:\/\/www.swiftiq.com\/","twitter":"https:\/\/twitter.com\/swiftiq","github":"https:\/\/github.com\/Storeplacer","blog":"http:\/\/www.swiftiq.com\/blog","blogrss":"http:\/\/www.swiftiq.com\/blog\/rss.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/swift-iq-logo.jpg","logo_width":"200","screenshot":null,"tags":"Adaptive Intelligence,API Management,API-Deployment,BaaS,Chicago,Data-Stack,E-commerce"},{"id":"21","name":"Vordel","summary":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-o","details":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-of-the-box integration with all the leading identity management platforms to provide comprehensive API Security.","website":"https:\/\/twitter.com\/dnsmadeeasy","twitter":"https:\/\/twitter.com\/vordel","github":"","blog":"http:\/\/resources.vordel.com\/index.php\/category\/blog\/","blogrss":"http:\/\/feeds.feedburner.com\/Vordelfeeds?format=xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-API-Management.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-Screenshot.png","tags":"API Gateway,API Management,API-Deployment,Enterprise,Vordel"},{"id":"2212","name":"Kimono Labs","summary":"Kimono is a way to turn websites into structured APIs from your browser in seconds. You don&rsquo;t need to write any code or install any software to extract data with Kimono. The easiest way to use Kimono is to add our bookmarklet to your browser&rsquo;s bookmark bar. Then go to the website you want to get data from and click the bookmarklet. Select the data you want and Kimono does the rest.","details":"Kimono is a way to turn websites into structured APIs from your browser in seconds. You don&rsquo;t need to write any code or install any software to extract data with Kimono. The easiest way to use Kimono is to add our bookmarklet to your browser&rsquo;s bookmark bar. Then go to the website you want to get data from and click the bookmarklet. Select the data you want and Kimono does the rest.","website":"https:\/\/www.kimonolabs.com\/","twitter":"https:\/\/twitter.com\/kimonolabs","github":"","blog":"http:\/\/blog.kimonolabs.com\/","blogrss":"http:\/\/blog.kimonolabs.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/kimono-labs-logo.png","logo_width":"140","screenshot":null,"tags":"API-Deployment,API-Scraping-Deployment,Scraping,Spreadsheets"},{"id":"2261","name":"Cosmic","summary":"A high level framework for crafting web APIs. Create, consume, manage and distribute web APIs with less code. How do you structure URLs? Which status code do you return? How do you parse complex query parameters? Cosmic takes full responsibility for the HTTP layer, letting you focus on what's important.","details":"A high level framework for crafting web APIs. Create, consume, manage and distribute web APIs with less code. How do you structure URLs? Which status code do you return? How do you parse complex query parameters? Cosmic takes full responsibility for the HTTP layer, letting you focus on what's important.","website":"http:\/\/www.cosmic-api.com\/","twitter":"https:\/\/twitter.com\/cosmic_api","github":"https:\/\/github.com\/cosmic-api","blog":"","blogrss":"http:\/\/blog.cosmic-api.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/cosmic-logo.png","logo_width":"150","screenshot":null,"tags":"API-Deployment,Python"},{"id":"2245","name":"MuleSoft","summary":"MuleSoft provides the most widely used integration platform for connecting SaaS and enterprise applications in the cloud and on-premise. With the rise of cloud and mobile, enterprises face a choice: get overwhelmed by the resulting explosion of end points or seize the opportunity to gain competitive advantage. Founded on the idea that connecting applications should not be hard, MuleSoft lets organ","details":"MuleSoft provides the most widely used integration platform for connecting SaaS and enterprise applications in the cloud and on-premise. With the rise of cloud and mobile, enterprises face a choice: get overwhelmed by the resulting explosion of end points or seize the opportunity to gain competitive advantage. Founded on the idea that connecting applications should not be hard, MuleSoft lets organizations harness the power of their applications through integration. MuleSoft&rsquo;s Anypoint&trade; technology eliminates costly, time-intensive point-to-point integration, enabling business agility. Delivered as a packaged integration experience, CloudHub&trade; and Mule ESB&trade; (Enterprise Service Bus) are built on proven open source technology for the fastest, most reliable on-premise and cloud integration without vendor lock-in.","website":"http:\/\/www.mulesoft.com\/","twitter":"https:\/\/twitter.com\/MuleSoft","github":"","blog":"http:\/\/blogs.mulesoft.org\/","blogrss":"http:\/\/feeds.feedburner.com\/muleblog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/mulesoft-logo.jpeg","logo_width":"150","screenshot":null,"tags":"API Design,API Management,API-Deployment"},{"id":"2266","name":"Orchestrate","summary":"Orchestrate provides a simple RESTful API service that eliminates the need for developers to operate their own databases in production. Powered by best-of-breed NoSQL databases, it unifies full-text search, social graph, activity feed, key\/value document and time-ordered event queries in a single interface, eliminating the operational and financial burden of deploying databases when both building ","details":"Orchestrate provides a simple RESTful API service that eliminates the need for developers to operate their own databases in production. Powered by best-of-breed NoSQL databases, it unifies full-text search, social graph, activity feed, key\/value document and time-ordered event queries in a single interface, eliminating the operational and financial burden of deploying databases when both building new applications and adding new features to existing ones. Behind the scenes, Orchestrate handles the complex task of building, operating, and scaling a high performance, fault tolerant data layer.","website":"http:\/\/orchestrate.io\/","twitter":"https:\/\/twitter.com\/OrchestrateIO","github":"https:\/\/github.com\/orchestrate-io\/","blog":"http:\/\/orchestrate.io\/blog\/","blogrss":"http:\/\/feeds.feedburner.com\/TheOrchestrateBlog?format=xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/Orchestrate_small-logo-600x124.png","logo_width":"160","screenshot":null,"tags":"Aggregation,API-Deployment,Data,Database-Stack"},{"id":"2650","name":"Flynn","summary":"The product that ops provides to developers. Ops should be a product team, not consultants. Flynn is the single platform that ops can provide to developers to power production, testing, and development, freeing developers to focus.","details":"The product that ops provides to developers. Ops should be a product team, not consultants. Flynn is the single platform that ops can provide to developers to power production, testing, and development, freeing developers to focus.","website":"https:\/\/flynn.io\/","twitter":"","github":"https:\/\/github.com\/flynn","blog":"https:\/\/flynn.io\/blog","blogrss":"https:\/\/flynn.io\/blog.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/flynn-logo.png","logo_width":"150","screenshot":null,"tags":"API Management,API-Deployment"},{"id":"2945","name":"Instant API","summary":"Instant API is Platform as a Service that makes it easy for Developers to Create, Host, Publish &amp; Document APIs from Existing Data and Services. What used to take weeks or months now takes minutes and is a fraction of the cost.","details":"Instant API is Platform as a Service that makes it easy for Developers to Create, Host, Publish &amp; Document APIs from Existing Data and Services. What used to take weeks or months now takes minutes and is a fraction of the cost.","website":"http:\/\/instantapi.co\/","twitter":"https:\/\/twitter.com\/instantapi","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/instant-api-logo.png","logo_width":"75","screenshot":null,"tags":"API-Deployment"},{"id":"2953","name":"Managed Methods","summary":"Managed Methods Inc. develops and sells solutions for the governance of cloud services and SOA environments. The company focuses on providing tools that enable visibility and control of Web services in the production environment. It offers CloudGate, a hosted cloud services management solution that delivers security, monitoring, and governance that gives control of Web-based services deployed in p","details":"Managed Methods Inc. develops and sells solutions for the governance of cloud services and SOA environments. The company focuses on providing tools that enable visibility and control of Web services in the production environment. It offers CloudGate, a hosted cloud services management solution that delivers security, monitoring, and governance that gives control of Web-based services deployed in public cloud infrastructures. The company also provides JaxView, an SOA management product that provides visibility and control for SOA, and cloud services and APIs. Managed Methods Inc. was incorporated in 2005 and is headquartered in Boulder, Colorado.","website":"http:\/\/managedmethods.com\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/managed-methods-logo.png","logo_width":"225","screenshot":null,"tags":"API-Deployment,API-Discovery"},{"id":"2959","name":"StrongLoop","summary":"StrongLoop is based in San Mateo, CA and employs over 30 developers working with Node.js. StrongLoop develops StrongLoop Suite, a leading Mobile API Tier along with being the primary code contributor to Node.js. StrongLoop Suite includes an open source private mBaaS, an operations console and a supported package of Node.js, containing advanced debugging, clustering and support for private npm regi","details":"StrongLoop is based in San Mateo, CA and employs over 30 developers working with Node.js. StrongLoop develops StrongLoop Suite, a leading Mobile API Tier along with being the primary code contributor to Node.js. StrongLoop Suite includes an open source private mBaaS, an operations console and a supported package of Node.js, containing advanced debugging, clustering and support for private npm registries. StrongLoop was founded by Node core-contributors, Enterprise mobile architects and veterans of open source and Could companies. StrongLoop is backed by Ignition Partners and Shasta Ventures and includes Marten Mickos, CEO of Eucalyptus (previously MySQL) as an advisor.","website":"http:\/\/strongloop.com\/","twitter":"https:\/\/twitter.com\/StrongLoop","github":"https:\/\/github.com\/strongloop","blog":"http:\/\/strongloop.com\/strongblog\/","blogrss":"http:\/\/strongloop.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/strongloop-logo.png","logo_width":"150","screenshot":null,"tags":"API Management,API-Deployment"},{"id":"6694","name":"BlockSpring","summary":"Blockspring creates API's for your Python, Ruby, and R scripts, so you can call them via HTTP. No server setup required. Paste in a script, double click on variables to make them parameters in your API, and click publish. No need to think about deploying code or spinning up servers - it just works.","details":"Blockspring creates API's for your Python, Ruby, and R scripts, so you can call them via HTTP. No server setup required. Paste in a script, double click on variables to make them parameters in your API, and click publish. No need to think about deploying code or spinning up servers - it just works.","website":"https:\/\/api.blockspring.com\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/blockspring-logo.png","logo_width":"150","screenshot":null,"tags":"API-Deployment,Containers"},{"id":"6565","name":"DreamFactory","summary":"DreamFactory Software is a private, venture-backed company based in Campbell, California, with an additional development center in Atlanta, Georgia. We were founded in 2005 and funded in 2006 by New Enterprise Associates. Today, DreamFactory publishes the DreamFactory Services Platform, an open source REST API platform for mobile application developers.","details":"DreamFactory Software is a private, venture-backed company based in Campbell, California, with an additional development center in Atlanta, Georgia. We were founded in 2005 and funded in 2006 by New Enterprise Associates. Today, DreamFactory publishes the DreamFactory Services Platform, an open source REST API platform for mobile application developers.","website":"http:\/\/www.dreamfactory.com\/","twitter":"https:\/\/twitter.com\/dfsoftwareinc","github":"https:\/\/github.com\/dreamfactorysoftware","blog":"http:\/\/blog.dreamfactory.com\/","blogrss":"http:\/\/blog.dreamfactory.com\/rss.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/dreamfactory.png","logo_width":"150","screenshot":null,"tags":"API-Deployment"},{"id":"9064","name":"FlowStacks","summary":"Our mission is to empower developers with a new type of technology that allows them to focus on features instead of battling the technical challenges and understanding of a back end. We believe this ability to seamlessly manage resources will give developers an opportunity to compete with the major software service companies with extensive budgets.","details":"Our mission is to empower developers with a new type of technology that allows them to focus on features instead of battling the technical challenges and understanding of a back end. We believe this ability to seamlessly manage resources will give developers an opportunity to compete with the major software service companies with extensive budgets.","website":"","twitter":"https:\/\/twitter.com\/FlowStacks_News","github":"https:\/\/github.com\/FlowStacks","blog":"https:\/\/flowstacks.com\/blog","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/flowstacks-logo.png","logo_width":"150","screenshot":null,"tags":"API-Deployment"},{"id":"6697","name":"Sheetlabs","summary":"Sheetlabs turn spreadsheets into well-documented APIs, quickly and easily. Many businesses still share product lists, service coverage areas, or other tabular information with one another using spreadsheets attached to email. There are so many things that can go wrong with this. Sheetlabs was built with the goal of making it really easy for businesses to build APIs on top of their spreadsheets.","details":"Sheetlabs turn spreadsheets into well-documented APIs, quickly and easily. Many businesses still share product lists, service coverage areas, or other tabular information with one another using spreadsheets attached to email. There are so many things that can go wrong with this. Sheetlabs was built with the goal of making it really easy for businesses to build APIs on top of their spreadsheets.","website":"https:\/\/sheetlabs.com","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/sheetlabs-logo.png","logo_width":"150","screenshot":null,"tags":"API-Deployment,Spreadsheets"}],"published":"10\/03\/2014"}